# ActualOtherLoad Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Space..::..ActualOtherLoad Property
Space Class See Also
---
Get the Actual Other Load of the Space.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double ActualOtherLoad { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ActualOtherLoad As Double
	Get
```

Visual C++
---
```text
public:
property double ActualOtherLoad {
	double get ();
}
```

# Remarks
This property is used to get the Actual Other Load (Unit: W) of the Space.
# See Also
Space Class
Autodesk.Revit.DB.Mechanical Namespace